{
  "common": {
    "close": "Close",
    "spanish": "Spanish",
    "english": "English"
  },
  "Header": {
    "home": "Home",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact"
  },
  "Home": {
    "welcome": "Hello 🖖🏻! I am",
    "presentation": "I specialize in creating modern, fluid and visually engaging user interfaces, combining design and functionality to deliver impactful digital experiences. I work with technologies such as React, React Native and Next.js, developing mobile applications and custom web pages.",
    "nameFunction": "welcome",
    "aboutMe": "aboutMe",
    "name": "name",
    "lastName": "lastName",
    "age": "age",
    "languages": "languages",
    "spanish": "spanish",
    "english": "english",
    "currentCountry": "currentCountry",
    "spain": "Spain",
    "nationality": "nationality",
    "argentina": "Argentina",
    "italian": "Italian",
    "resume": "Resume"
  },
  "Skills": {
    "title": "Skills",
    "js": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. It is a prototype-based, multi-paradigm, single-threaded, dynamic language, with support for object-oriented, imperative and declarative programming (e.g. functional programming).",
    "next": "Next.js is a React framework for building full-stack web applications. You use React Components to build user interfaces, and Next.js for additional features and optimizations.Under the hood, Next.js also abstracts and automatically configures tooling needed for React, like bundling, compiling, and more. This allows you to focus on building your application instead of spending time with configuration.",
    "react": "React is a JavaScript library for rendering user interfaces. UI is built from small units like buttons, text, and images. React lets you combine them into reusable, nestable components. React Native is an open source framework for building Android and iOS applications using React and the app platform’s native capabilities.",
    "firebase": "Firebase is a cloud platform for developing web and mobile applications. Its essential function is to make the creation of web and mobile applications and their development easier. Its tools are varied and easy to use. Their purposes can be divided into four groups: development, growth, monetization and analysis.",
    "ts": "TypeScript is a superset of JavaScript that adds optional static typing and advanced features to JavaScript. It has been developed by Microsoft and was first published in October 2012. It allows us to write code with fewer errors, in a simpler, more consistent and easier to test way.",
    "node": "Node.js is an open source, cross-platform JavaScript runtime environment. A Node.js application runs in a single process, without creating a new thread for each request. When Node.js performs an I/O operation, such as accessing a database, instead of blocking the thread and wasting CPU cycles waiting, Node.js will resume operations when the response arrives. This allows Node.js to handle thousands of simultaneous connections to a single server.",
    "prisma": "Prisma is an open-source next-generation ORM. It consists of the following parts: Prisma Client: Auto-generated and type-safe query builder for Node.js & TypeScript. Prisma Migrate: Migration system. Prisma Studio: GUI to view and edit data in your database. Prisma Client can be used in any Node.js or TypeScript backend application. This can be a REST API, a GraphQL API, a gRPC API, or anything else that needs a database.",
    "postgres": "PostgreSQL is a powerful, open source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. PostgreSQL comes with many features aimed at help developers build applications, protect data integrity, create fault-tolerant environments, and help them manage their data no matter how big or small the dataset is.",
    "express": "Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications. It is designed to build single-page, multi-page, and hybrid web applications. It is a framework that provides a set of features for building web and mobile applications. It is a framework that provides a set of features for building web and mobile applications.",
    "nest": "Nest.js is a framework for building efficient, scalable Node.js server-side applications. It uses progressive JavaScript, is built with TypeScript (preserves compatibility with pure JavaScript) and combines elements of OOP (Object Oriented Programming), FP (Functional Programming), and FRP (Functional Reactive Programming). Under the hood, Nest.js uses Express, but also, provides a level of abstraction above Express. This way, Nest.js is highly compatible with a wide range of databases, protocols, and technologies.",
    "zustand": "Zustand is a state management library for React that allows you to manage state in a simple and efficient way. It is a library that provides a set of features for managing state in React. It is a library that provides a set of features for managing state in React.",
    "nextui": "NextUI is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications.",
    "tailwind": "Tailwind CSS is a utility-first CSS framework that streamlines the process of building custom designs. It is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications.",
    "styled": "Styled Components is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications.",
    "drizzle": "Drizzle is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications. It is a library that provides a set of features for building web and mobile applications."
  },
  "Projects": {
    "worldRank": {
      "description": "World Rank is a web application that allows users to access detailed information about all the countries in the world, with filtering options by name, region, and subregion."
    },
    "videxthub": {
      "description": "A technical challenge that involves exploring a catalog of videos, accessing detailed information for each one, and the ability to upload new videos."
    },
    "ucademy": {
      "description": "Ucademy Dashboard is a technical challenge designed for efficient user management, featuring an interactive table to view and manage data, along with a form to add new users."
    },
    "biteplan": {
      "description": "Bite Plan is an application I developed for the Desaway company, which allows users to manage their weekly menus. Organizing dishes by day of the week and allowing for tracking of dishes served."
    },
    "re-k": {
      "description": "Software intended to facilitate the energy rehabilitation of properties. Manages three roles: Promoter, who registers the projects; Agent, executes the projects; and Admin, in charge of coordinating, creating tenders and managing payments."
    },
    "workhub": {
      "description": "Platform designed for the management and reservation of workspaces, meeting rooms and shared spaces. Create easily customized and optimized workspaces for your specific needs."
    },
    "work-space": {
      "description": "Make reservations in rooms and shared spaces created and managed from the Work Hub app."
    }
  },
  "Experience": {
    "coursesTaken": "Courses taken",
    "projectsDone": "Projects done",
    "monthsOfExperience": "Months of experience",
    "coderDate": "April 2023 - September 2023",
    "coderDescription": "Company dedicated to providing digital certified courses.",
    "coderRole": "Student tutor",
    "desawayDate": "October 2023 - December 2024",
    "desawayDescription": "Company focused on the development of web pages, mobile applications, software and custom design.",
    "desawayRole": "Frontend Developer"
  }
}
