{
  "common": {
    "close": "Cerrar"
  },
  "Header": {
    "home": "Inicio",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "contact": "Contacto"
  },
  "Home": {
    "welcome": "Hola 游둤游낕! Soy",
    "presentation": "Me especializo en crear interfaces de usuario modernas, fluidas y visualmente atractivas, combinando dise침o y funcionalidad para ofrecer experiencias digitales impactantes. Trabajo con tecnolog칤as como React, React Native y Next.js, desarrollando aplicaciones m칩viles y p치ginas web a medida.",
    "nameFunction": "bienvenida",
    "aboutMe": "sobreMi",
    "name": "nombre",
    "lastName": "apellido",
    "age": "edad",
    "languages": "idiomas",
    "spanish": "espa침ol",
    "english": "ingl칠s",
    "currentCountry": "paisActual",
    "spain": "Espa침a",
    "nationality": "nacionalidad",
    "argentina": "Argentina",
    "italian": "Italiana",
    "viewCV": "Ver CV"
  },
  "Skills": {
    "title": "Tecnolog칤as",
    "js": "JavaScript (JS) es un lenguaje de programaci칩n ligero, interpretado, o compilado justo-a-tiempo (just-in-time) con funciones de primera clase. Es un lenguaje basado en prototipos, multiparadigma, de un solo hilo, din치mico, con soporte para programaci칩n orientada a objetos, imperativa y declarativa (por ejemplo programaci칩n funcional).",
    "next": "Next.js es un marco de React para crear aplicaciones web de pila completa. Utiliza React Components para crear interfaces de usuario y Next.js para funciones y optimizaciones adicionales. Debajo del cap칩, Next.js tambi칠n abstrae y configura autom치ticamente las herramientas necesarias para React, como agrupaci칩n, compilaci칩n y m치s. Esto le permite concentrarse en crear su aplicaci칩n en lugar de dedicar tiempo a la configuraci칩n.",
    "react": "React es una biblioteca de JavaScript para representar interfaces de usuario. La interfaz de usuario se construye a partir de unidades peque침as como botones, texto e im치genes. React te permite combinarlos en componentes encajables y reutilizables. React Native es un marco de c칩digo abierto para crear aplicaciones de Android e iOS utilizando React y las capacidades nativas de la plataforma de aplicaciones.",
    "firebase": "Firebase es una plataforma en la nube para el desarrollo de aplicaciones web y m칩vil. Su funci칩n esencial es hacer m치s sencilla la creaci칩n de aplicaciones webs como m칩viles y su desarrollo. Sus herramientas son variadas y de f치cil uso. Las finalidades de las mismas se pueden dividir en cuatro grupos: desarrollo, crecimiento, monetizaci칩n y an치lisis.",
    "ts": "TypeScript es un superconjunto de JavaScript que a침ade tipado est치tico opcional y funciones avanzadas a JavaScript. Ha sido desarrollado por Microsoft y se public칩 por primera vez en octubre de 2012. Permite que podamos escribir c칩digo con menos errores, de manera m치s sencilla, coherente y f치cil de probar.",
    "node": "Node.js es un entorno de ejecuci칩n de JavaScript multiplataforma y de c칩digo abierto. Una aplicaci칩n Node.js se ejecuta en un solo proceso, sin crear un nuevo hilo para cada solicitud. Cuando Node.js realiza una operaci칩n de E/S, como acceder a una base de datos, en lugar de bloquear el subproceso y desperdiciar ciclos de CPU esperando, Node.js reanudar치 las operaciones cuando llegue la respuesta.Esto permite a Node.js manejar miles de conexiones simult치neas con un 칰nico servidor.",
    "prisma": "Prisma es un ORM de c칩digo abierto de pr칩xima generaci칩n. Consta de las siguientes partes: Prisma Client: generador de consultas generado autom치ticamente y con seguridad de tipos para Node.js y TypeScript. Prisma Migrate: sistema de migraci칩n. Prisma Studio: GUI para ver y editar datos en su base de datos. Prisma Client se puede utilizar en cualquier aplicaci칩n backend de Node.js o TypeScript. Puede ser una API REST, una API GraphQL, una API gRPC o cualquier otra cosa que necesite una base de datos.",
    "postgres": "PostgreSQL es un potente sistema de base de datos relacional de objetos de c칩digo abierto que utiliza y ampl칤a el lenguaje SQL combinado con muchas funciones que almacenan y escalan de forma segura las cargas de trabajo de datos m치s complicadas. PostgreSQL viene con muchas funciones destinadas a ayudar a los desarrolladores a crear aplicaciones, a proteger la integridad de los datos, a crear entornos tolerantes a fallas, y ayudarlos a administrar sus datos sin importar cu치n grande o peque침o sea el conjunto de datos.",
    "express": "Express es un marco de aplicaci칩n web minimalista y flexible para Node.js que proporciona un conjunto robusto de caracter칤sticas para aplicaciones web y m칩viles. Est치 dise침ado para crear aplicaciones web de una sola p치gina, de varias p치ginas y h칤bridas. Es un marco que proporciona un conjunto de caracter칤sticas para crear aplicaciones web y m칩viles.",
    "nest": "Nest.js es un marco para construir aplicaciones eficientes, escalables y de servidor de Node.js. Utiliza JavaScript progresivo, est치 construido con TypeScript (mantiene la compatibilidad con JavaScript puro) y combina elementos de OOP (Programaci칩n Orientada a Objetos), FP (Programaci칩n Funcional) y FRP (Programaci칩n Funcional Reactiva). Debajo del cap칩, Nest.js utiliza Express, pero tambi칠n proporciona un nivel de abstracci칩n por encima de Express. Esto hace que Nest.js sea altamente compatible con una amplia gama de bases de datos, protocolos y tecnolog칤as.",
    "zustand": "Zustand es una biblioteca de gesti칩n de estados para React que permite gestionar el estado de manera simple y eficiente. Es una biblioteca que proporciona un conjunto de caracter칤sticas para gestionar el estado en React. Es una biblioteca que proporciona un conjunto de caracter칤sticas para gestionar el estado en React.",
    "nextui": "NextUI es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles.",
    "tailwind": "Tailwind CSS es un framework CSS utilitario que simplifica el proceso de creaci칩n de dise침os personalizados. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles.",
    "styled": "Styled Components es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles.",
    "drizzle": "Drizzle es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles. Es una biblioteca que proporciona un conjunto de caracter칤sticas para construir aplicaciones web y m칩viles."
  },
  "Projects": {
    "worldRank": {
      "description": "World Rank es una aplicaci칩n web que permite consultar informaci칩n detallada sobre todos los pa칤ses del mundo, con opciones de filtrado por nombre, regi칩n y subregi칩n."
    },
    "videxthub": {
      "description": "Desaf칤o t칠cnico que implica explorar un cat치logo de videos, acceder a los detalles de cada uno con informaci칩n completa y la capacidad de subir nuevos videos."
    },
    "ucademy": {
      "description": "Ucademy Dashboard es un reto t칠cnico dise침ado para gestionar usuarios de manera eficiente, con una tabla interactiva para visualizar y administrar datos, y un formulario para agregar nuevos usuarios."
    },
    "biteplan": {
      "description": "Bite Plan es una aplicaci칩n la cual desarroll칠 para la empresa Desaway, la cual permite a los usuarios gestionar sus men칰s semanales. Organizando los platos por d칤as de la semana y permitiendo llevar un control de los platos que se han servido."
    },
    "re-k": {
      "description": "Software intento para facilitar la rehabilitaci칩n energ칠tica de inmuebles. Gestiona tres roles: Promotor, quien registra los proyectos; Agente, ejecuta los proyectos; y Admin, encargado de coordinar, crear licitaciones y gestionar pagos."
    }
  },
  "Experience": {
    "coursesTaken": "Cursos realizados",
    "projectsDone": "Projectos hechos",
    "monthsOfExperience": "Meses de experiencia",
    "coderDate": "Abril 2023 - Septiembre 2023",
    "coderDescription": "Empresa dedicada a brindar cursos digitales certificados.",
    "coderRole": "Tutor de alumnos",
    "desawayDate": "Octubre 2023 - Actualidad",
    "desawayDescription": "Empresa enfocada en el desarrollo de p치ginas web, aplicaciones m칩viles, software y dise침o a medida.",
    "desawayRole": "Frontend Developer"
  }
}

